app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("amount", "created_at", "orderID", "product", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 5], ["created_at", "2014-11-20 00:08:52.837001"], ["orderID", 1], ["product", "Budweiser"], ["updated_at", "2014-11-20 00:08:52.837001"]]