app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "productID", "productName", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-19 21:29:22.301821"], ["productID", 0], ["productName", "Cola"], ["updated_at", "2014-11-19 21:29:22.301821"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "productID" = $1, "productName" = $2, "updated_at" = $3 WHERE "products"."id" = 1  [["productID", 1], ["productName", "Budweiser"], ["updated_at", "2014-11-19 21:29:35.412460"]]